primer_proyecto/app/Controllers/login_controller.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'Mirko'
 LIMIT 1
---
public function auth()
{
    $session = session();
    $model = new Usuarios_model();

    /* Creamos los datos del formulario */
    $login = $this->request->getVar('email'); //Permitimos que el campo 'email' sea el nombre de usuario o el correo electrónico
    $password = $this->request->getVar('pass');

    /*Verificamos si el campo 'email' es un correo electrónico*/
    if (filter_var($login, FILTER_VALIDATE_EMAIL)) {
        //Si es un correo electrónico, buscamos por correo electrónico
        $data = $model->where('email', $login)->first();
    } else {
        //Si no es un correo electrónico, buscamos por nombre de usuario
        $data = $model->where('usuario', $login)->first();